## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.form_viewer must be replaced
+/- resource "aws_acm_certificate" "form_viewer" {
      ~ arn                       = "arn:aws:acm:ca-central-1:687401027353:certificate/e0d9fd55-738a-4ab6-bfda-1ecacec99b06" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "forms-staging.cdssandbox.xyz"
              - resource_record_name  = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws."
            },
          + {
              + domain_name           = "api.forms-staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "forms-staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:687401027353:certificate/e0d9fd55-738a-4ab6-bfda-1ecacec99b06" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2024-12-14T23:59:59Z" -> (known after apply)
      ~ not_before                = "2023-11-16T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "api.forms-staging.cdssandbox.xyz",
            # (1 unchanged element hidden)
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ options {
          + arn                       = (known after apply)
          + certificate_authority_arn = (known after apply)
          + certificate_body          = (known after apply)
          + certificate_chain         = (known after apply)
          + domain_name               = (known after apply)
          + domain_validation_options = (known after apply)
          + early_renewal_duration    = (known after apply)
          + id                        = (known after apply)
          + key_algorithm             = (known after apply)
          + not_after                 = (known after apply)
          + not_before                = (known after apply)
          + pending_renewal           = (known after apply)
          + private_key               = (known after apply)
          + renewal_eligibility       = (known after apply)
          + renewal_summary           = (known after apply)
          + status                    = (known after apply)
          + subject_alternative_names = (known after apply)
          + tags                      = (known after apply)
          + tags_all                  = (known after apply)
          + type                      = (known after apply)
          + validation_emails         = (known after apply)
          + validation_method         = (known after apply)
        } -> (known after apply)
    }

  # aws_acm_certificate.form_viewer_maintenance_mode must be replaced
+/- resource "aws_acm_certificate" "form_viewer_maintenance_mode" {
      ~ arn                       = "arn:aws:acm:us-east-1:687401027353:certificate/477e3f0d-675e-4c4b-822e-866d482d4928" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "forms-staging.cdssandbox.xyz"
              - resource_record_name  = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws."
            },
          + {
              + domain_name           = "api.forms-staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "forms-staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:687401027353:certificate/477e3f0d-675e-4c4b-822e-866d482d4928" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2024-12-14T23:59:59Z" -> (known after apply)
      ~ not_before                = "2023-11-16T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "api.forms-staging.cdssandbox.xyz",
            # (1 unchanged element hidden)
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ options {
          + arn                       = (known after apply)
          + certificate_authority_arn = (known after apply)
          + certificate_body          = (known after apply)
          + certificate_chain         = (known after apply)
          + domain_name               = (known after apply)
          + domain_validation_options = (known after apply)
          + early_renewal_duration    = (known after apply)
          + id                        = (known after apply)
          + key_algorithm             = (known after apply)
          + not_after                 = (known after apply)
          + not_before                = (known after apply)
          + pending_renewal           = (known after apply)
          + private_key               = (known after apply)
          + renewal_eligibility       = (known after apply)
          + renewal_summary           = (known after apply)
          + status                    = (known after apply)
          + subject_alternative_names = (known after apply)
          + tags                      = (known after apply)
          + tags_all                  = (known after apply)
          + type                      = (known after apply)
          + validation_emails         = (known after apply)
          + validation_method         = (known after apply)
        } -> (known after apply)
    }

  # aws_alb_listener_rule.form_api[0] will be created
  + resource "aws_alb_listener_rule" "form_api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34"
      + priority     = 100
      + tags_all     = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "HEALTHY"
              + status_code  = "200"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "api.forms-staging.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_cloudfront_distribution.maintenance_mode will be updated in-place
  ~ resource "aws_cloudfront_distribution" "maintenance_mode" {
        id                              = "E2NX6QAIR13JTM"
        tags                            = {}
        # (22 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:687401027353:certificate/477e3f0d-675e-4c4b-822e-866d482d4928" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb_listener.form_viewer_https will be updated in-place
  ~ resource "aws_lb_listener" "form_viewer_https" {
      ~ certificate_arn   = "arn:aws:acm:ca-central-1:687401027353:certificate/e0d9fd55-738a-4ab6-bfda-1ecacec99b06" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34"
        tags              = {}
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb_target_group.form_api[0] will be created
  + resource "aws_lb_target_group" "form_api" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "form-api"
      + name_prefix                        = (known after apply)
      + port                               = 3001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "form_api"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "form_api"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0ad5b3739860129d0"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 10
          + matcher             = "200"
          + path                = "/"
          + port                = "3001"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_route53_record.form_api[0] will be created
  + resource "aws_route53_record" "form_api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.forms-staging.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z05990652HOQ0SGHD81ZC"

      + alias {
          + evaluate_target_health = true
          + name                   = "form-viewer-1810755345.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-staging.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "form_viewer_certificate_validation" {
      ~ fqdn                             = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z05990652HOQ0SGHD81ZC__42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz" # forces replacement -> (known after apply) # forces replacement
      ~ records                          = [
          - "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.form_viewer_maintenance_mode_certificate_validation["forms-staging.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "form_viewer_maintenance_mode_certificate_validation" {
      ~ fqdn                             = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z05990652HOQ0SGHD81ZC__42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz" # forces replacement -> (known after apply) # forces replacement
      ~ records                          = [
          - "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "92da9411-8b49-4c9e-b80f-ac7ea482f3d1"
        name        = "forms_base_url"
        tags        = {}
        # (5 unchanged attributes hidden)

      + regular_expression {
          + regex_string = "^api.forms-staging.cdssandbox.xyz$"
        }

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 3 to change, 4 to destroy.

Changes to Outputs:
  + lb_target_group_api_arn        = (known after apply)
  + lb_target_group_api_arn_suffix = (known after apply)

Error: Invalid index

  on route53.tf line 86, in resource "aws_route53_record" "form_viewer_certificate_validation":
  86:   zone_id         = local.domain_name_to_zone_id[each.value.domain]
    ├────────────────
    │ each.value.domain is "api.forms-staging.cdssandbox.xyz"
    │ local.domain_name_to_zone_id is object with 1 attribute "forms-staging.cdssandbox.xyz"

The given key does not identify an element in this collection value.

Error: Invalid index

  on route53.tf line 104, in resource "aws_route53_record" "form_viewer_maintenance_mode_certificate_validation":
 104:   zone_id         = local.domain_name_to_zone_id[each.value.domain]
    ├────────────────
    │ each.value.domain is "api.forms-staging.cdssandbox.xyz"
    │ local.domain_name_to_zone_id is object with 1 attribute "forms-staging.cdssandbox.xyz"

The given key does not identify an element in this collection value.
time=2024-07-23T20:22:08Z level=error msg=terraform invocation failed in /home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer/.terragrunt-cache/8CJu3E6tls1VOlHT6vQAFFRgrcQ/-syjFrdAaB-6kNXhMmF1nXBOp7o/load_balancer error=[/home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer/.terragrunt-cache/8CJu3E6tls1VOlHT6vQAFFRgrcQ/-syjFrdAaB-6kNXhMmF1nXBOp7o/load_balancer] exit status 1 prefix=[/home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer] 
time=2024-07-23T20:22:08Z level=error msg=1 error occurred:
	* [/home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer/.terragrunt-cache/8CJu3E6tls1VOlHT6vQAFFRgrcQ/-syjFrdAaB-6kNXhMmF1nXBOp7o/load_balancer] exit status 1



```

</details>

